Процедура ПриЗаписи(Отказ)
	ФИОБылоИзменено = Ложь;
	ДополнительныеСвойства.Свойство("ФИОБылоИзменено", ФИОБылоИзменено);

	Если ФИОБылоИзменено <> Неопределено И ФИОБылоИзменено Тогда 
		МенеджерЗаписи = РегистрыСведений.ФИОФизическихЛиц.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Имя = ДополнительныеСвойства.Имя;
		МенеджерЗаписи.Фамилия = ДополнительныеСвойства.Фамилия;
		МенеджерЗаписи.Отчество = ДополнительныеСвойства.Отчество;
		МенеджерЗаписи.ФизическоеЛицо = Ссылка;

		Если Ссылка.Пустая() Тогда
			МенеджерЗаписи.Период = Дата(1, 1, 1, 0, 0, 1);
		Иначе
			МенеджерЗаписи.Период = ТекущаяДата();
		КонецЕсли;

		МенеджерЗаписи.Записать();
	КонецЕсли;
КонецПроцедуры