&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Фамилия = "";
		Имя = "";
		Отчество = "";
		Возврат;
	КонецЕсли;

	МассивПодстрок = СтрРазделить(Объект.Наименование, " ", Ложь);
	Фамилия = МассивПодстрок[0];

	Если МассивПодстрок.Количество() > 1 Тогда
		Имя = МассивПодстрок[1];
	Иначе
		Имя = "";
	КонецЕсли;

	Если МассивПодстрок.Количество() > 2 Тогда
		Отчество = МассивПодстрок[2];
	Иначе
		Отчество = "";
	КонецЕсли;

	Объект.Наименование = СокрЛП(Фамилия + " " + Имя + " " + Отчество);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ИсходноеНаименование <> ТекущийОбъект.Наименование И НЕ Объект.ЭтоГруппа Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ФИОБылоИзменено", Истина);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("Имя", Имя);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("Фамилия", Фамилия);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("Отчество", Отчество);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИсходноеНаименование = Объект.Наименование;
КонецПроцедуры